
// import java.util.Arrays;

public class hw_22 {
   public static void main(String[] args) {
      /*
       Дана строка (получение через обычный текстовый файл!!!)

"фамилия":"Иванов","оценка":"5","предмет":"Математика"
"фамилия":"Петрова","оценка":"4","предмет":"Информатика"

Написать метод(ы), который распарсит строку и, используя StringBuilder, создаст строки вида:
Студент [фамилия] получил [оценка] по предмету [предмет].

Пример вывода:
Студент Иванов получил 5 по предмету Математика.
Студент Петрова получил 4 по предмету Информатика.
Студент Краснов получил 5 по предмету Физика.
       */
      // String[] arr = {"фамилия":"Иванов","оценка":"5","предмет":"Математика"};
      // String[] array = arr.replace('"', ',');
      // System.out.println(Arrays.toString(array));

      // for (int i = 0; i < array.length; i++) {
      //    arr.replace('"', '');
      // }
   }
}

